In [1]:
import pandas as pd

In [2]:
list1=['detergent Powder','SOAP','bisuits','milk','cold drink']

In [3]:
df=pd.DataFrame(list1)

In [4]:
df

                  0
0  detergent Powder
1              SOAP
2           bisuits
3              milk
4        cold drink

In [5]:
dict1={"item":['detergent Powder','SOAP','bisuits','milk','cold drink'],"price":[200,300,70.6,900,140],'Qty':[2,5,10,12,4]}

In [6]:
a=pd.DataFrame(dict1)

In [7]:
a

               item  price  Qty
0  detergent Powder  200.0    2
1              SOAP  300.0    5
2           bisuits   70.6   10
3              milk  900.0   12
4        cold drink  140.0    4

In [8]:
a[['item',"Qty"]]

               item  Qty
0  detergent Powder    2
1              SOAP    5
2           bisuits   10
3              milk   12
4        cold drink    4

In [9]:
a

               item  price  Qty
0  detergent Powder  200.0    2
1              SOAP  300.0    5
2           bisuits   70.6   10
3              milk  900.0   12
4        cold drink  140.0    4

In [10]:
sp=[220,350,100,980,170]

In [11]:
a["MSP"] = sp

In [12]:
a

               item  price  Qty  MSP
0  detergent Powder  200.0    2  220
1              SOAP  300.0    5  350
2           bisuits   70.6   10  100
3              milk  900.0   12  980
4        cold drink  140.0    4  170

In [13]:
a.drop(["price"],axis=1,inplace=True)

In [14]:
a

               item  Qty  MSP
0  detergent Powder    2  220
1              SOAP    5  350
2           bisuits   10  100
3              milk   12  980
4        cold drink    4  170

In [16]:
data =pd.read_csv("sheet1.csv",index_col="ID")

In [17]:
data

       Name  Salary
ID
101    Ram    20000
102   shyam   30000
103   seeta    5000
104   geeta   12000
105  radhey   14000
106  ramesh   30000
107  suresh   50000

In [18]:
data.loc[101]

Name       Ram
Salary    20000
Name: 101, dtype: object

In [19]:
data.loc[105]

Name      radhey
Salary     14000
Name: 105, dtype: object

In [20]:
data

       Name  Salary
ID
101    Ram    20000
102   shyam   30000
103   seeta    5000
104   geeta   12000
105  radhey   14000
106  ramesh   30000
107  suresh   50000

In [21]:
data.drop([101],inplace=True)

In [22]:
data

       Name  Salary
ID
102   shyam   30000
103   seeta    5000
104   geeta   12000
105  radhey   14000
106  ramesh   30000
107  suresh   50000

In [32]:
new_row = pd.DataFrame({'Name':'John','Salary':100000},index=[110])

In [33]:
pd.concat([data,new_row])

       Name  Salary
102   shyam   30000
103   seeta    5000
104   geeta   12000
105  radhey   14000
106  ramesh   30000
107  suresh   50000
110    John  100000